
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1. 原则笔记 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Part I</li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    读书
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="2.1.1" data-path="读书笔记.html">
            
                <a href="读书笔记.html">
            
                    
                    1. 原则笔记
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1. 原则笔记</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x540D;&#x8BCD;&#x89E3;&#x91CA;">&#x540D;&#x8BCD;&#x89E3;&#x91CA;</h3>
<ol>
<li><p>&#x5BF9;&#x51B2;</p>
</li>
<li><p>&#x5229;&#x7387;</p>
</li>
<li><p>&#x8D27;&#x5E01;&#x5E02;&#x573A;</p>
</li>
<li><p>&#x98CE;&#x9669;&#x655E;&#x53E3;</p>
</li>
<li><p>&#x517B;&#x8001;&#x57FA;&#x91D1;</p>
</li>
<li><p>&#x503A;&#x5238;</p>
</li>
<li><p>&#x4FE1;&#x6258;&#x6295;&#x8D44;</p>
</li>
<li><p>&#x505A;&#x7A7A;</p>
</li>
<li><p>&#x80A1;&#x6743;&#x6295;&#x8D44;</p>
</li>
<li><p>&#x5927;&#x5B97;&#x5546;&#x54C1;</p>
</li>
<li><p>&#x589E;&#x957F;&#x7387;&#x548C;&#x901A;&#x80C0;&#x7387;</p>
</li>
<li><p>&#x98CE;&#x9669;&#x5E73;&#x4EF7;</p>
</li>
<li><p>&#x53CC;&#x76F8;&#x969C;&#x788D;</p>
</li>
</ol>
<h3 id="&#x53E5;&#x5B50;&#x6458;&#x6284;">&#x53E5;&#x5B50;&#x6458;&#x6284;</h3>
<ol>
<li><p>&#x5F53;&#x653F;&#x5E9C;&#x51B3;&#x7B56;&#x8005;&#x5411;&#x4F60;&#x627F;&#x8BFA;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x5141;&#x8BB8;&#x8D27;&#x5E01;&#x8D2C;&#x503C;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x4E0D;&#x8981;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x8D8A;&#x662F;&#x575A;&#x5B9A;&#x5730;&#x505A;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x627F;&#x8BFA;&#xFF0C;&#x5C40;&#x52BF;&#x4E5F;&#x8BB8;&#x5C31;&#x8D8A;&#x4E25;&#x91CD;&#xFF0C;&#x56E0;&#x800C;&#x8D27;&#x5E01;&#x8D2C;&#x503C;&#x5373;&#x5C06;&#x53D1;&#x751F;&#x7684;&#x6982;&#x7387;&#x4E5F;&#x8D8A;&#x5927;&#x3002;</p>
</li>
<li><p>&#x5229;&#x7528;&#x963F;&#x5C14;&#x6CD5;&#x53E0;&#x52A0;&#x7684;&#x65B9;&#x6CD5;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x4E0D;&#x53D7;&#x6F5C;&#x5728;&#x5E02;&#x573A;&#x8868;&#x73B0;&#x5F71;&#x54CD;&#x7684;&#x62BC;&#x6CE8;&#x65B9;&#x5F0F;&#x3002;&#x5229;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5BF9;&#x5F85;&#x5E02;&#x573A;&#x8BA9;&#x6211;&#x660E;&#x767D;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x6295;&#x8D44;&#x8005;&#x7684;&#x8981;&#x8BC0;&#x4E4B;&#x4E00;&#xFF0C;&#x662F;&#x53EA;&#x5BF9;&#x4F60;&#x6709;&#x9AD8;&#x5EA6;&#x4FE1;&#x5FC3;&#x7684;&#x6295;&#x8D44;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5192;&#x9669;&#x62BC;&#x6CE8;&#xFF0C;&#x5E76;&#x5BF9;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5145;&#x5206;&#x7684;&#x6295;&#x8D44;&#x3002;&#xFF08;&#x6CE8;&#xFF1A;&#x8D1D;&#x5854;&#xFF08;&#x6D88;&#x6781;&#xFF09;&#x3001;&#x963F;&#x5C14;&#x6CD5;&#xFF08;&#x79EF;&#x6781;&#xFF09;&#xFF09;</p>
</li>
<li><p>&#x5C3D;&#x7BA1;&#x9519;&#x8FC7;&#x4E86;&#x5728;&#x4E2D;&#x56FD;&#x53D1;&#x5C55;&#x91D1;&#x878D;&#x7684;&#x597D;&#x673A;&#x4F1A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5E76;&#x4E0D;&#x540E;&#x6094;&#x6211;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x6211;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EE5;&#x52E4;&#x594B;&#x6709;&#x6709;&#x521B;&#x9020;&#x6027;&#x7684;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5F97;&#x5230;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x3002;&#x6210;&#x719F;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x653E;&#x5F03;&#x4E00;&#x4E9B;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4ECE;&#x800C;&#x8FFD;&#x6C42;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
</li>
<li><p>&#x6240;&#x6709;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x6295;&#x8D44;&#x8005;&#x548C;&#x6295;&#x8D44;&#x7B56;&#x7565;&#x90FD;&#x662F;&#x6709;&#x5F31;&#x70B9;&#x7684;&#x3002;&#x5728;&#x5F31;&#x70B9;&#x5448;&#x73B0;&#x65F6;&#x5BF9;&#x5176;&#x5931;&#x53BB;&#x4FE1;&#x5FC3;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x5176;&#x6709;&#x6548;&#x65F6;&#x5BF9;&#x5176;&#x8FC7;&#x4E8E;&#x8FF7;&#x604B;&#x4E00;&#x6837;&#x3002;&#x660E;&#x667A;&#x7684;&#x4EBA;&#x5728;&#x7ECF;&#x5386;&#x4E86;&#x5404;&#x79CD;&#x6C89;&#x6D6E;&#x65F6;&#x90FD;&#x59CB;&#x7EC8;&#x53EE;&#x7D27;&#x7A33;&#x5065;&#x7684;&#x57FA;&#x672C;&#x9762;&#xFF0C;&#x800C;&#x8F7B;&#x6D6E;&#x7684;&#x4EBA;&#x8DDF;&#x7740;&#x611F;&#x89C9;&#x8D70;&#xFF0C;&#x505A;&#x51FA;&#x60C5;&#x7EEA;&#x82B1;&#x7684;&#x53CD;&#x5E94;&#xFF0C;&#x5BF9;&#x4E8E;&#x70ED;&#x95E8;&#x7684;&#x4E1C;&#x897F;&#x4E00;&#x62E5;&#x800C;&#x4E0A;&#xFF0C;&#x4E0D;&#x70ED;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x9A6C;&#x4E0A;&#x653E;&#x5F03;&#x3002;</p>
</li>
<li><p>&#x4ECE;&#x65E9;&#x671F;&#x7684;&#x5931;&#x8D25;&#x7ECF;&#x5386;&#x4E2D;&#xFF0C;&#x6211;&#x61C2;&#x5F97;&#x4E86;&#x4E0D;&#x7BA1;&#x6211;&#x5728;&#x8FDB;&#x884C;&#x62BC;&#x6CE8;&#x65F6;&#x591A;&#x4E48;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x53EF;&#x80FD;&#x662F;&#x9519;&#x7684;&#xFF0C;&#x800C;&#x8981;&#x964D;&#x4F4E;&#x98CE;&#x9669;&#x53C8;&#x4E0D;&#x964D;&#x4F4E;&#x6536;&#x76CA;&#xFF0C;&#x5408;&#x7406;&#x7684;&#x591A;&#x6837;&#x5316;&#x662F;&#x5173;&#x952E;&#x3002;</p>
</li>
<li><p>&#x4ECE;&#x4E92;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x6295;&#x8D44;&#x7EC4;&#x5408;&#x60F3;&#x5230;&#xFF0C;&#x60F3;&#x8981;&#x62E5;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x52BF;&#xFF0C;&#x800C;&#x53C8;&#x4E0D;&#x66B4;&#x9732;&#x4E8E;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x52A3;&#x52BF;&#x4E4B;&#x4E0B;&#xFF0C;&#x6700;&#x7A33;&#x59A5;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x505A;&#x51FA;&#x4E00;&#x7CFB;&#x5217;&#x826F;&#x597D;&#x7684;&#x3001;&#x4E92;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x62BC;&#x6CE8;&#xFF0C;&#x5F7C;&#x6B64;&#x5E73;&#x8861;&#xFF0C;&#x76F8;&#x4E92;&#x8865;&#x5145;&#x3002;</p>
</li>
<li><p>&#x5F53;&#x9762;&#x5BF9;&#x4E24;&#x79CD;&#x4F60;&#x90FD;&#x9700;&#x8981;&#x4F46;&#x770B;&#x8D77;&#x6765;&#x77DB;&#x76FE;&#x7684;&#x9009;&#x62E9;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8010;&#x5FC3;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5C3D;&#x6700;&#x5927;&#x7684;&#x53EF;&#x80FD;&#x517C;&#x987E;&#x4E24;&#x8005;&#x3002;&#x51E0;&#x4E4E;&#x603B;&#x6709;&#x4E00;&#x6761;&#x9053;&#x8DEF;&#x662F;&#x5B58;&#x5728;&#x4F46;&#x4F60;&#x8FD8;&#x6CA1;&#x6709;&#x627E;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5E94;&#x8BE5;&#x52AA;&#x529B;&#x5BFB;&#x627E;&#x76F4;&#x5230;&#x627E;&#x5230;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x51D1;&#x5408;&#x7740;&#x63A5;&#x53D7;&#x90A3;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x660E;&#x663E;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
</li>
<li><p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x8005;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x7684;&#x6700;&#x5927;&#x6210;&#x529F;&#x5C31;&#x662F;&#x80FD;&#x591F;&#x7EC4;&#x7EC7;&#x5176;&#x4ED6;&#x4EBA;&#x5728;&#x6CA1;&#x6709;&#x4F60;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF1B;&#x6B21;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x80FD;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#x8FDE;&#x4F60;&#x81EA;&#x5DF1;&#x90FD;&#x505A;&#x4E0D;&#x597D;&#x3002;</p>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1. 原则笔记","level":"2.1.1","depth":2,"previous":{"title":"读书","level":"2.1","depth":1,"ref":"","articles":[{"title":"1. 原则笔记","level":"2.1.1","depth":2,"path":"原则/读书笔记.md","ref":"原则/读书笔记.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"原则/读书笔记.md","mtime":"2020-03-25T14:59:46.034Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-25T15:12:52.689Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

